; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v9 ?v1)
             (pred_12 ?v2 ?v7)
             (pred_7 ?v9 ?v7)
             (pred_8 ?v5 ?v9 )
	     (pred_5 ?v9)
             (pred_2 ?v6)
             (pred_9 ?v2)
             (pred_11 ?v7)
             (pred_1 ?v9)
             (pred_10 ?v2)
             (pred_4 ?v9)
             (pred_3 ))



(:action op_1
:parameters (?v8 ?v10 ?v13 ?v11)
:precondition (and (pred_2 ?v8) (pred_2 ?v10) (pred_9 ?v13) (pred_11 ?v11)
          (pred_6 ?v8 ?v10) (pred_12 ?v13 ?v11)
                   (pred_7 ?v10 ?v11) (pred_5 ?v8) 
                   (pred_1 ?v10) (pred_10 ?v13))
:effect (and  (pred_4 ?v10) (not (pred_1 ?v10))))


(:action op_4
:parameters (?v8 ?v3)
:precondition (and (pred_2 ?v8) (pred_2 ?v3)
               (pred_5 ?v8) (pred_6 ?v8 ?v3) (pred_4 ?v3))
:effect (and (pred_5 ?v3) (not (pred_5 ?v8))))

(:action op_3
:parameters (?v8 ?v13)
:precondition (and (pred_2 ?v8) (pred_9 ?v13) 
                  (pred_5 ?v8) (pred_8 ?v13 ?v8) (pred_3 ))
:effect (and (pred_10 ?v13)
   (not (pred_8 ?v13 ?v8)) (not (pred_3 ))))


(:action op_5
:parameters (?v8 ?v4 ?v12)
:precondition (and (pred_2 ?v8) (pred_9 ?v4) (pred_9 ?v12)
                  (pred_5 ?v8) (pred_10 ?v12) (pred_8 ?v4 ?v8))
:effect (and (pred_10 ?v4) (pred_8 ?v12 ?v8)
        (not (pred_10 ?v12)) (not (pred_8 ?v4 ?v8))))

(:action op_2
:parameters (?v8 ?v13)
:precondition (and (pred_2 ?v8) (pred_9 ?v13) 
                  (pred_5 ?v8) (pred_10 ?v13))
:effect (and (pred_3 ) (pred_8 ?v13 ?v8) (not (pred_10 ?v13)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_17 obj_04 obj_07 obj_19 obj_01 obj_16 obj_15 obj_05 obj_08 obj_10 obj_14 obj_13 obj_06 obj_11 obj_02
    obj_12 obj_18
    obj_21 obj_20 obj_09
    )

    (:init
       (pred_3)

       (pred_2 obj_03)
       (pred_2 obj_17)
       (pred_2 obj_04)
       (pred_2 obj_07)
       (pred_2 obj_19)
       (pred_2 obj_01)
       (pred_2 obj_16)
       (pred_2 obj_15)
       (pred_2 obj_05)
       (pred_2 obj_08)
       (pred_2 obj_10)
       (pred_2 obj_14)
       (pred_2 obj_13)
       (pred_2 obj_06)
       (pred_2 obj_11)
       (pred_2 obj_02)
       (pred_11 obj_12)
       (pred_11 obj_18)
       (pred_9 obj_21)
       (pred_9 obj_20)
       (pred_9 obj_09)

       (pred_6 obj_03 obj_19)
       (pred_6 obj_03 obj_17)
       (pred_6 obj_17 obj_01)
       (pred_6 obj_17 obj_04)
       (pred_6 obj_17 obj_03)
       (pred_6 obj_04 obj_16)
       (pred_6 obj_04 obj_07)
       (pred_6 obj_04 obj_17)
       (pred_6 obj_07 obj_15)
       (pred_6 obj_07 obj_04)
       (pred_6 obj_19 obj_05)
       (pred_6 obj_19 obj_01)
       (pred_6 obj_19 obj_03)
       (pred_6 obj_01 obj_08)
       (pred_6 obj_01 obj_16)
       (pred_6 obj_01 obj_17)
       (pred_6 obj_01 obj_19)
       (pred_6 obj_16 obj_10)
       (pred_6 obj_16 obj_15)
       (pred_6 obj_16 obj_04)
       (pred_6 obj_16 obj_01)
       (pred_6 obj_15 obj_14)
       (pred_6 obj_15 obj_07)
       (pred_6 obj_15 obj_16)
       (pred_6 obj_05 obj_13)
       (pred_6 obj_05 obj_08)
       (pred_6 obj_05 obj_19)
       (pred_6 obj_08 obj_06)
       (pred_6 obj_08 obj_10)
       (pred_6 obj_08 obj_01)
       (pred_6 obj_08 obj_05)
       (pred_6 obj_10 obj_11)
       (pred_6 obj_10 obj_14)
       (pred_6 obj_10 obj_16)
       (pred_6 obj_10 obj_08)
       (pred_6 obj_14 obj_02)
       (pred_6 obj_14 obj_15)
       (pred_6 obj_14 obj_10)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_13 obj_05)
       (pred_6 obj_06 obj_11)
       (pred_6 obj_06 obj_08)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_11 obj_02)
       (pred_6 obj_11 obj_10)
       (pred_6 obj_11 obj_06)
       (pred_6 obj_02 obj_14)
       (pred_6 obj_02 obj_11)
       (pred_1 obj_13)
       (pred_1 obj_07)
       (pred_1 obj_02)
       (pred_7  obj_13 obj_12)
       (pred_7  obj_07 obj_18)
       (pred_7  obj_02 obj_18)
       (pred_4 obj_03)
       (pred_4 obj_17)
       (pred_4 obj_04)
       (pred_4 obj_19)
       (pred_4 obj_01)
       (pred_4 obj_16)
       (pred_4 obj_15)
       (pred_4 obj_05)
       (pred_4 obj_08)
       (pred_4 obj_10)
       (pred_4 obj_14)
       (pred_4 obj_06)
       (pred_4 obj_11)

       (pred_12  obj_21 obj_12)
       (pred_12  obj_20 obj_18)
       (pred_12  obj_09 obj_18)
       (pred_8 obj_21 obj_15)
       (pred_8 obj_20 obj_03)
       (pred_8 obj_09 obj_19)
       (pred_5 obj_19)
    )

    (:goal (and
       (pred_8 obj_09 obj_02)
    ))
(:constraints
  (always (not (pred_5 obj_14)))
)
)

; plan
1. (op_3 obj_19 obj_09)
   deleted: (pred_8 obj_09 obj_19) (pred_3)
   added: (pred_10 obj_09)
   goals met: 0 of 1
2. (op_4 obj_19 obj_01)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_01)
   goals met: 0 of 1
3. (op_4 obj_01 obj_16)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_16)
   goals met: 0 of 1
4. (op_4 obj_16 obj_10)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_10)
   goals met: 0 of 1
5. (op_4 obj_10 obj_11)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_11)
   goals met: 0 of 1
6. (op_1 obj_11 obj_02 obj_09 obj_18)
   deleted: (pred_1 obj_02)
   added: (pred_4 obj_02)
   goals met: 0 of 1
7. (op_4 obj_11 obj_02)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_02)
   goals met: 0 of 1
8. (op_2 obj_02 obj_09)
   deleted: (pred_10 obj_09)
   added: (pred_3) (pred_8 obj_09 obj_02)
   goals met: 1 of 1
